Infineon/mtb-xmclib-cat3/CMSIS/Infineon/COMPONENT_XMC4502/Include/XMC4502.h
/* -----------------------------  GPDMA1_CLEARSRCTRAN  ---------------------------- */
#define GPDMA1_CLEARSRCTRAN_CH0_Pos           (0UL)                     /*!< GPDMA1 CLEARSRCTRAN: CH0 (Bit 0)                            */
#define GPDMA1_CLEARSRCTRAN_CH0_Msk           (0x1UL)                   /*!< GPDMA1 CLEARSRCTRAN: CH0 (Bitfield-Mask: 0x01)              */
#define GPDMA1_CLEARSRCTRAN_CH1_Pos           (1UL)                     /*!< GPDMA1 CLEARSRCTRAN: CH1 (Bit 1)                            */
#define GPDMA1_CLEARSRCTRAN_CH1_Msk           (0x2UL)                   /*!< GPDMA1 CLEARSRCTRAN: CH1 (Bitfield-Mask: 0x01)              */
#define GPDMA1_CLEARSRCTRAN_CH2_Pos           (2UL)                     /*!< GPDMA1 CLEARSRCTRAN: CH2 (Bit 2)                            */
#define GPDMA1_CLEARSRCTRAN_CH2_Msk           (0x4UL)                   /*!< GPDMA1 CLEARSRCTRAN: CH2 (Bitfield-Mask: 0x01)              */
#define GPDMA1_CLEARSRCTRAN_CH3_Pos           (3UL)                     /*!< GPDMA1 CLEARSRCTRAN: CH3 (Bit 3)                            */
#define GPDMA1_CLEARSRCTRAN_CH3_Msk           (0x8UL)                   /*!< GPDMA1 CLEARSRCTRAN: CH3 (Bitfield-Mask: 0x01)              */

/* -----------------------------  GPDMA1_CLEARDSTTRAN  ---------------------------- */
#define GPDMA1_CLEARDSTTRAN_CH0_Pos           (0UL)                     /*!< GPDMA1 CLEARDSTTRAN: CH0 (Bit 0)                            */
#define GPDMA1_CLEARDSTTRAN_CH0_Msk           (0x1UL)                   /*!< GPDMA1 CLEARDSTTRAN: CH0 (Bitfield-Mask: 0x01)              */
#define GPDMA1_CLEARDSTTRAN_CH1_Pos           (1UL)                     /*!< GPDMA1 CLEARDSTTRAN: CH1 (Bit 1)                            */
#define GPDMA1_CLEARDSTTRAN_CH1_Msk           (0x2UL)                   /*!< GPDMA1 CLEARDSTTRAN: CH1 (Bitfield-Mask: 0x01)              */
#define GPDMA1_CLEARDSTTRAN_CH2_Pos           (2UL)                     /*!< GPDMA1 CLEARDSTTRAN: CH2 (Bit 2)                            */
#define GPDMA1_CLEARDSTTRAN_CH2_Msk           (0x4UL)                   /*!< GPDMA1 CLEARDSTTRAN: CH2 (Bitfield-Mask: 0x01)              */
#define GPDMA1_CLEARDSTTRAN_CH3_Pos           (3UL)                     /*!< GPDMA1 CLEARDSTTRAN: CH3 (Bit 3)                            */
#define GPDMA1_CLEARDSTTRAN_CH3_Msk           (0x8UL)                   /*!< GPDMA1 CLEARDSTTRAN: CH3 (Bitfield-Mask: 0x01)              */

/* -------------------------------  GPDMA1_CLEARERR  ------------------------------ */
#define GPDMA1_CLEARERR_CH0_Pos               (0UL)                     /*!< GPDMA1 CLEARERR: CH0 (Bit 0)                                */
#define GPDMA1_CLEARERR_CH0_Msk               (0x1UL)                   /*!< GPDMA1 CLEARERR: CH0 (Bitfield-Mask: 0x01)                  */
#define GPDMA1_CLEARERR_CH1_Pos               (1UL)                     /*!< GPDMA1 CLEARERR: CH1 (Bit 1)                                */
#define GPDMA1_CLEARERR_CH1_Msk               (0x2UL)                   /*!< GPDMA1 CLEARERR: CH1 (Bitfield-Mask: 0x01)                  */
#define GPDMA1_CLEARERR_CH2_Pos               (2UL)                     /*!< GPDMA1 CLEARERR: CH2 (Bit 2)                                */
#define GPDMA1_CLEARERR_CH2_Msk               (0x4UL)                   /*!< GPDMA1 CLEARERR: CH2 (Bitfield-Mask: 0x01)                  */
#define GPDMA1_CLEARERR_CH3_Pos               (3UL)                     /*!< GPDMA1 CLEARERR: CH3 (Bit 3)                                */
#define GPDMA1_CLEARERR_CH3_Msk               (0x8UL)                   /*!< GPDMA1 CLEARERR: CH3 (Bitfield-Mask: 0x01)                  */

/* ------------------------------  GPDMA1_STATUSINT  ------------------------------ */
#define GPDMA1_STATUSINT_TFR_Pos              (0UL)                     /*!< GPDMA1 STATUSINT: TFR (Bit 0)                               */
#define GPDMA1_STATUSINT_TFR_Msk              (0x1UL)                   /*!< GPDMA1 STATUSINT: TFR (Bitfield-Mask: 0x01)                 */
#define GPDMA1_STATUSINT_BLOCK_Pos            (1UL)                     /*!< GPDMA1 STATUSINT: BLOCK (Bit 1)                             */
#define GPDMA1_STATUSINT_BLOCK_Msk            (0x2UL)                   /*!< GPDMA1 STATUSINT: BLOCK (Bitfield-Mask: 0x01)               */
#define GPDMA1_STATUSINT_SRCT_Pos             (2UL)                     /*!< GPDMA1 STATUSINT: SRCT (Bit 2)                              */
#define GPDMA1_STATUSINT_SRCT_Msk             (0x4UL)                   /*!< GPDMA1 STATUSINT: SRCT (Bitfield-Mask: 0x01)                */
#define GPDMA1_STATUSINT_DSTT_Pos             (3UL)                     /*!< GPDMA1 STATUSINT: DSTT (Bit 3)                              */
#define GPDMA1_STATUSINT_DSTT_Msk             (0x8UL)                   /*!< GPDMA1 STATUSINT: DSTT (Bitfield-Mask: 0x01)                */
#define GPDMA1_STATUSINT_ERR_Pos              (4UL)                     /*!< GPDMA1 STATUSINT: ERR (Bit 4)                               */
#define GPDMA1_STATUSINT_ERR_Msk              (0x10UL)                  /*!< GPDMA1 STATUSINT: ERR (Bitfield-Mask: 0x01)                 */

/* ------------------------------  GPDMA1_REQSRCREG  ------------------------------ */
#define GPDMA1_REQSRCREG_CH0_Pos              (0UL)                     /*!< GPDMA1 REQSRCREG: CH0 (Bit 0)                               */
#define GPDMA1_REQSRCREG_CH0_Msk              (0x1UL)                   /*!< GPDMA1 REQSRCREG: CH0 (Bitfield-Mask: 0x01)                 */
#define GPDMA1_REQSRCREG_CH1_Pos              (1UL)                     /*!< GPDMA1 REQSRCREG: CH1 (Bit 1)                               */
#define GPDMA1_REQSRCREG_CH1_Msk              (0x2UL)                   /*!< GPDMA1 REQSRCREG: CH1 (Bitfield-Mask: 0x01)                 */
#define GPDMA1_REQSRCREG_CH2_Pos              (2UL)                     /*!< GPDMA1 REQSRCREG: CH2 (Bit 2)                               */
#define GPDMA1_REQSRCREG_CH2_Msk              (0x4UL)                   /*!< GPDMA1 REQSRCREG: CH2 (Bitfield-Mask: 0x01)                 */
#define GPDMA1_REQSRCREG_CH3_Pos              (3UL)                     /*!< GPDMA1 REQSRCREG: CH3 (Bit 3)                               */
#define GPDMA1_REQSRCREG_CH3_Msk              (0x8UL)                   /*!< GPDMA1 REQSRCREG: CH3 (Bitfield-Mask: 0x01)                 */
#define GPDMA1_REQSRCREG_WE_CH0_Pos           (8UL)                     /*!< GPDMA1 REQSRCREG: WE_CH0 (Bit 8)                            */
#define GPDMA1_REQSRCREG_WE_CH0_Msk           (0x100UL)                 /*!< GPDMA1 REQSRCREG: WE_CH0 (Bitfield-Mask: 0x01)              */
#define GPDMA1_REQSRCREG_WE_CH1_Pos           (9UL)                     /*!< GPDMA1 REQSRCREG: WE_CH1 (Bit 9)                            */
#define GPDMA1_REQSRCREG_WE_CH1_Msk           (0x200UL)                 /*!< GPDMA1 REQSRCREG: WE_CH1 (Bitfield-Mask: 0x01)              */
#define GPDMA1_REQSRCREG_WE_CH2_Pos           (10UL)                    /*!< GPDMA1 REQSRCREG: WE_CH2 (Bit 10)                           */
#define GPDMA1_REQSRCREG_WE_CH2_Msk           (0x400UL)                 /*!< GPDMA1 REQSRCREG: WE_CH2 (Bitfield-Mask: 0x01)              */
#define GPDMA1_REQSRCREG_WE_CH3_Pos           (11UL)                    /*!< GPDMA1 REQSRCREG: WE_CH3 (Bit 11)                           */
#define GPDMA1_REQSRCREG_WE_CH3_Msk           (0x800UL)                 /*!< GPDMA1 REQSRCREG: WE_CH3 (Bitfield-Mask: 0x01)              */

