Infineon/mtb-xmclib-cat3/CMSIS/Infineon/COMPONENT_XMC4502/Include/XMC4502.h
/* ------------------------------  SDMMC_BLOCK_SIZE  ------------------------------ */
#define SDMMC_BLOCK_SIZE_TX_BLOCK_SIZE_Pos    (0UL)                     /*!< SDMMC BLOCK_SIZE: TX_BLOCK_SIZE (Bit 0)                     */
#define SDMMC_BLOCK_SIZE_TX_BLOCK_SIZE_Msk    (0xfffUL)                 /*!< SDMMC BLOCK_SIZE: TX_BLOCK_SIZE (Bitfield-Mask: 0xfff)      */
#define SDMMC_BLOCK_SIZE_TX_BLOCK_SIZE_12_Pos (15UL)                    /*!< SDMMC BLOCK_SIZE: TX_BLOCK_SIZE_12 (Bit 15)                 */
#define SDMMC_BLOCK_SIZE_TX_BLOCK_SIZE_12_Msk (0x8000UL)                /*!< SDMMC BLOCK_SIZE: TX_BLOCK_SIZE_12 (Bitfield-Mask: 0x01)    */

/* ------------------------------  SDMMC_BLOCK_COUNT  ----------------------------- */
#define SDMMC_BLOCK_COUNT_BLOCK_COUNT_Pos     (0UL)                     /*!< SDMMC BLOCK_COUNT: BLOCK_COUNT (Bit 0)                      */
#define SDMMC_BLOCK_COUNT_BLOCK_COUNT_Msk     (0xffffUL)                /*!< SDMMC BLOCK_COUNT: BLOCK_COUNT (Bitfield-Mask: 0xffff)      */

/* -------------------------------  SDMMC_ARGUMENT1  ------------------------------ */
#define SDMMC_ARGUMENT1_ARGUMENT1_Pos         (0UL)                     /*!< SDMMC ARGUMENT1: ARGUMENT1 (Bit 0)                          */
#define SDMMC_ARGUMENT1_ARGUMENT1_Msk         (0xffffffffUL)            /*!< SDMMC ARGUMENT1: ARGUMENT1 (Bitfield-Mask: 0xffffffff)      */

/* -----------------------------  SDMMC_TRANSFER_MODE  ---------------------------- */
#define SDMMC_TRANSFER_MODE_BLOCK_COUNT_EN_Pos (1UL)                    /*!< SDMMC TRANSFER_MODE: BLOCK_COUNT_EN (Bit 1)                 */
#define SDMMC_TRANSFER_MODE_BLOCK_COUNT_EN_Msk (0x2UL)                  /*!< SDMMC TRANSFER_MODE: BLOCK_COUNT_EN (Bitfield-Mask: 0x01)   */
#define SDMMC_TRANSFER_MODE_ACMD_EN_Pos       (2UL)                     /*!< SDMMC TRANSFER_MODE: ACMD_EN (Bit 2)                        */
#define SDMMC_TRANSFER_MODE_ACMD_EN_Msk       (0xcUL)                   /*!< SDMMC TRANSFER_MODE: ACMD_EN (Bitfield-Mask: 0x03)          */
#define SDMMC_TRANSFER_MODE_TX_DIR_SELECT_Pos (4UL)                     /*!< SDMMC TRANSFER_MODE: TX_DIR_SELECT (Bit 4)                  */
#define SDMMC_TRANSFER_MODE_TX_DIR_SELECT_Msk (0x10UL)                  /*!< SDMMC TRANSFER_MODE: TX_DIR_SELECT (Bitfield-Mask: 0x01)    */
#define SDMMC_TRANSFER_MODE_MULTI_BLOCK_SELECT_Pos (5UL)                /*!< SDMMC TRANSFER_MODE: MULTI_BLOCK_SELECT (Bit 5)             */
#define SDMMC_TRANSFER_MODE_MULTI_BLOCK_SELECT_Msk (0x20UL)             /*!< SDMMC TRANSFER_MODE: MULTI_BLOCK_SELECT (Bitfield-Mask: 0x01) */
#define SDMMC_TRANSFER_MODE_CMD_COMP_ATA_Pos  (6UL)                     /*!< SDMMC TRANSFER_MODE: CMD_COMP_ATA (Bit 6)                   */
#define SDMMC_TRANSFER_MODE_CMD_COMP_ATA_Msk  (0x40UL)                  /*!< SDMMC TRANSFER_MODE: CMD_COMP_ATA (Bitfield-Mask: 0x01)     */

/* --------------------------------  SDMMC_COMMAND  ------------------------------- */
#define SDMMC_COMMAND_RESP_TYPE_SELECT_Pos    (0UL)                     /*!< SDMMC COMMAND: RESP_TYPE_SELECT (Bit 0)                     */
#define SDMMC_COMMAND_RESP_TYPE_SELECT_Msk    (0x3UL)                   /*!< SDMMC COMMAND: RESP_TYPE_SELECT (Bitfield-Mask: 0x03)       */
#define SDMMC_COMMAND_CMD_CRC_CHECK_EN_Pos    (3UL)                     /*!< SDMMC COMMAND: CMD_CRC_CHECK_EN (Bit 3)                     */
#define SDMMC_COMMAND_CMD_CRC_CHECK_EN_Msk    (0x8UL)                   /*!< SDMMC COMMAND: CMD_CRC_CHECK_EN (Bitfield-Mask: 0x01)       */
#define SDMMC_COMMAND_CMD_IND_CHECK_EN_Pos    (4UL)                     /*!< SDMMC COMMAND: CMD_IND_CHECK_EN (Bit 4)                     */
#define SDMMC_COMMAND_CMD_IND_CHECK_EN_Msk    (0x10UL)                  /*!< SDMMC COMMAND: CMD_IND_CHECK_EN (Bitfield-Mask: 0x01)       */
#define SDMMC_COMMAND_DATA_PRESENT_SELECT_Pos (5UL)                     /*!< SDMMC COMMAND: DATA_PRESENT_SELECT (Bit 5)                  */
#define SDMMC_COMMAND_DATA_PRESENT_SELECT_Msk (0x20UL)                  /*!< SDMMC COMMAND: DATA_PRESENT_SELECT (Bitfield-Mask: 0x01)    */
#define SDMMC_COMMAND_CMD_TYPE_Pos            (6UL)                     /*!< SDMMC COMMAND: CMD_TYPE (Bit 6)                             */
#define SDMMC_COMMAND_CMD_TYPE_Msk            (0xc0UL)                  /*!< SDMMC COMMAND: CMD_TYPE (Bitfield-Mask: 0x03)               */
#define SDMMC_COMMAND_CMD_IND_Pos             (8UL)                     /*!< SDMMC COMMAND: CMD_IND (Bit 8)                              */
#define SDMMC_COMMAND_CMD_IND_Msk             (0x3f00UL)                /*!< SDMMC COMMAND: CMD_IND (Bitfield-Mask: 0x3f)                */

/* -------------------------------  SDMMC_RESPONSE0  ------------------------------ */
#define SDMMC_RESPONSE0_RESPONSE0_Pos         (0UL)                     /*!< SDMMC RESPONSE0: RESPONSE0 (Bit 0)                          */
#define SDMMC_RESPONSE0_RESPONSE0_Msk         (0xffffUL)                /*!< SDMMC RESPONSE0: RESPONSE0 (Bitfield-Mask: 0xffff)          */
#define SDMMC_RESPONSE0_RESPONSE1_Pos         (16UL)                    /*!< SDMMC RESPONSE0: RESPONSE1 (Bit 16)                         */
#define SDMMC_RESPONSE0_RESPONSE1_Msk         (0xffff0000UL)            /*!< SDMMC RESPONSE0: RESPONSE1 (Bitfield-Mask: 0xffff)          */

/* -------------------------------  SDMMC_RESPONSE2  ------------------------------ */
#define SDMMC_RESPONSE2_RESPONSE2_Pos         (0UL)                     /*!< SDMMC RESPONSE2: RESPONSE2 (Bit 0)                          */
#define SDMMC_RESPONSE2_RESPONSE2_Msk         (0xffffUL)                /*!< SDMMC RESPONSE2: RESPONSE2 (Bitfield-Mask: 0xffff)          */
#define SDMMC_RESPONSE2_RESPONSE3_Pos         (16UL)                    /*!< SDMMC RESPONSE2: RESPONSE3 (Bit 16)                         */
#define SDMMC_RESPONSE2_RESPONSE3_Msk         (0xffff0000UL)            /*!< SDMMC RESPONSE2: RESPONSE3 (Bitfield-Mask: 0xffff)          */

/* -------------------------------  SDMMC_RESPONSE4  ------------------------------ */
#define SDMMC_RESPONSE4_RESPONSE4_Pos         (0UL)                     /*!< SDMMC RESPONSE4: RESPONSE4 (Bit 0)                          */
#define SDMMC_RESPONSE4_RESPONSE4_Msk         (0xffffUL)                /*!< SDMMC RESPONSE4: RESPONSE4 (Bitfield-Mask: 0xffff)          */
#define SDMMC_RESPONSE4_RESPONSE5_Pos         (16UL)                    /*!< SDMMC RESPONSE4: RESPONSE5 (Bit 16)                         */
#define SDMMC_RESPONSE4_RESPONSE5_Msk         (0xffff0000UL)            /*!< SDMMC RESPONSE4: RESPONSE5 (Bitfield-Mask: 0xffff)          */

/* -------------------------------  SDMMC_RESPONSE6  ------------------------------ */
#define SDMMC_RESPONSE6_RESPONSE6_Pos         (0UL)                     /*!< SDMMC RESPONSE6: RESPONSE6 (Bit 0)                          */
#define SDMMC_RESPONSE6_RESPONSE6_Msk         (0xffffUL)                /*!< SDMMC RESPONSE6: RESPONSE6 (Bitfield-Mask: 0xffff)          */
#define SDMMC_RESPONSE6_RESPONSE7_Pos         (16UL)                    /*!< SDMMC RESPONSE6: RESPONSE7 (Bit 16)                         */
#define SDMMC_RESPONSE6_RESPONSE7_Msk         (0xffff0000UL)            /*!< SDMMC RESPONSE6: RESPONSE7 (Bitfield-Mask: 0xffff)          */

/* ------------------------------  SDMMC_DATA_BUFFER  ----------------------------- */
#define SDMMC_DATA_BUFFER_DATA_BUFFER_Pos     (0UL)                     /*!< SDMMC DATA_BUFFER: DATA_BUFFER (Bit 0)                      */
#define SDMMC_DATA_BUFFER_DATA_BUFFER_Msk     (0xffffffffUL)            /*!< SDMMC DATA_BUFFER: DATA_BUFFER (Bitfield-Mask: 0xffffffff)  */

/* -----------------------------  SDMMC_PRESENT_STATE  ---------------------------- */
#define SDMMC_PRESENT_STATE_COMMAND_INHIBIT_CMD_Pos (0UL)               /*!< SDMMC PRESENT_STATE: COMMAND_INHIBIT_CMD (Bit 0)            */
#define SDMMC_PRESENT_STATE_COMMAND_INHIBIT_CMD_Msk (0x1UL)             /*!< SDMMC PRESENT_STATE: COMMAND_INHIBIT_CMD (Bitfield-Mask: 0x01) */
#define SDMMC_PRESENT_STATE_COMMAND_INHIBIT_DAT_Pos (1UL)               /*!< SDMMC PRESENT_STATE: COMMAND_INHIBIT_DAT (Bit 1)            */
#define SDMMC_PRESENT_STATE_COMMAND_INHIBIT_DAT_Msk (0x2UL)             /*!< SDMMC PRESENT_STATE: COMMAND_INHIBIT_DAT (Bitfield-Mask: 0x01) */
#define SDMMC_PRESENT_STATE_DAT_LINE_ACTIVE_Pos (2UL)                   /*!< SDMMC PRESENT_STATE: DAT_LINE_ACTIVE (Bit 2)                */
#define SDMMC_PRESENT_STATE_DAT_LINE_ACTIVE_Msk (0x4UL)                 /*!< SDMMC PRESENT_STATE: DAT_LINE_ACTIVE (Bitfield-Mask: 0x01)  */
#define SDMMC_PRESENT_STATE_WRITE_TRANSFER_ACTIVE_Pos (8UL)             /*!< SDMMC PRESENT_STATE: WRITE_TRANSFER_ACTIVE (Bit 8)          */
#define SDMMC_PRESENT_STATE_WRITE_TRANSFER_ACTIVE_Msk (0x100UL)         /*!< SDMMC PRESENT_STATE: WRITE_TRANSFER_ACTIVE (Bitfield-Mask: 0x01) */
#define SDMMC_PRESENT_STATE_READ_TRANSFER_ACTIVE_Pos (9UL)              /*!< SDMMC PRESENT_STATE: READ_TRANSFER_ACTIVE (Bit 9)           */
#define SDMMC_PRESENT_STATE_READ_TRANSFER_ACTIVE_Msk (0x200UL)          /*!< SDMMC PRESENT_STATE: READ_TRANSFER_ACTIVE (Bitfield-Mask: 0x01) */
#define SDMMC_PRESENT_STATE_BUFFER_WRITE_ENABLE_Pos (10UL)              /*!< SDMMC PRESENT_STATE: BUFFER_WRITE_ENABLE (Bit 10)           */
#define SDMMC_PRESENT_STATE_BUFFER_WRITE_ENABLE_Msk (0x400UL)           /*!< SDMMC PRESENT_STATE: BUFFER_WRITE_ENABLE (Bitfield-Mask: 0x01) */
#define SDMMC_PRESENT_STATE_BUFFER_READ_ENABLE_Pos (11UL)               /*!< SDMMC PRESENT_STATE: BUFFER_READ_ENABLE (Bit 11)            */
#define SDMMC_PRESENT_STATE_BUFFER_READ_ENABLE_Msk (0x800UL)            /*!< SDMMC PRESENT_STATE: BUFFER_READ_ENABLE (Bitfield-Mask: 0x01) */
#define SDMMC_PRESENT_STATE_CARD_INSERTED_Pos (16UL)                    /*!< SDMMC PRESENT_STATE: CARD_INSERTED (Bit 16)                 */
#define SDMMC_PRESENT_STATE_CARD_INSERTED_Msk (0x10000UL)               /*!< SDMMC PRESENT_STATE: CARD_INSERTED (Bitfield-Mask: 0x01)    */
#define SDMMC_PRESENT_STATE_CARD_STATE_STABLE_Pos (17UL)                /*!< SDMMC PRESENT_STATE: CARD_STATE_STABLE (Bit 17)             */
#define SDMMC_PRESENT_STATE_CARD_STATE_STABLE_Msk (0x20000UL)           /*!< SDMMC PRESENT_STATE: CARD_STATE_STABLE (Bitfield-Mask: 0x01) */
#define SDMMC_PRESENT_STATE_CARD_DETECT_PIN_LEVEL_Pos (18UL)            /*!< SDMMC PRESENT_STATE: CARD_DETECT_PIN_LEVEL (Bit 18)         */
#define SDMMC_PRESENT_STATE_CARD_DETECT_PIN_LEVEL_Msk (0x40000UL)       /*!< SDMMC PRESENT_STATE: CARD_DETECT_PIN_LEVEL (Bitfield-Mask: 0x01) */
#define SDMMC_PRESENT_STATE_WRITE_PROTECT_PIN_LEVEL_Pos (19UL)          /*!< SDMMC PRESENT_STATE: WRITE_PROTECT_PIN_LEVEL (Bit 19)       */
#define SDMMC_PRESENT_STATE_WRITE_PROTECT_PIN_LEVEL_Msk (0x80000UL)     /*!< SDMMC PRESENT_STATE: WRITE_PROTECT_PIN_LEVEL (Bitfield-Mask: 0x01) */
#define SDMMC_PRESENT_STATE_DAT_3_0_PIN_LEVEL_Pos (20UL)                /*!< SDMMC PRESENT_STATE: DAT_3_0_PIN_LEVEL (Bit 20)             */
#define SDMMC_PRESENT_STATE_DAT_3_0_PIN_LEVEL_Msk (0xf00000UL)          /*!< SDMMC PRESENT_STATE: DAT_3_0_PIN_LEVEL (Bitfield-Mask: 0x0f) */
#define SDMMC_PRESENT_STATE_CMD_LINE_LEVEL_Pos (24UL)                   /*!< SDMMC PRESENT_STATE: CMD_LINE_LEVEL (Bit 24)                */
#define SDMMC_PRESENT_STATE_CMD_LINE_LEVEL_Msk (0x1000000UL)            /*!< SDMMC PRESENT_STATE: CMD_LINE_LEVEL (Bitfield-Mask: 0x01)   */
#define SDMMC_PRESENT_STATE_DAT_7_4_PIN_LEVEL_Pos (25UL)                /*!< SDMMC PRESENT_STATE: DAT_7_4_PIN_LEVEL (Bit 25)             */
#define SDMMC_PRESENT_STATE_DAT_7_4_PIN_LEVEL_Msk (0x1e000000UL)        /*!< SDMMC PRESENT_STATE: DAT_7_4_PIN_LEVEL (Bitfield-Mask: 0x0f) */

/* -------------------------------  SDMMC_HOST_CTRL  ------------------------------ */
#define SDMMC_HOST_CTRL_LED_CTRL_Pos          (0UL)                     /*!< SDMMC HOST_CTRL: LED_CTRL (Bit 0)                           */
#define SDMMC_HOST_CTRL_LED_CTRL_Msk          (0x1UL)                   /*!< SDMMC HOST_CTRL: LED_CTRL (Bitfield-Mask: 0x01)             */
#define SDMMC_HOST_CTRL_DATA_TX_WIDTH_Pos     (1UL)                     /*!< SDMMC HOST_CTRL: DATA_TX_WIDTH (Bit 1)                      */
#define SDMMC_HOST_CTRL_DATA_TX_WIDTH_Msk     (0x2UL)                   /*!< SDMMC HOST_CTRL: DATA_TX_WIDTH (Bitfield-Mask: 0x01)        */
#define SDMMC_HOST_CTRL_HIGH_SPEED_EN_Pos     (2UL)                     /*!< SDMMC HOST_CTRL: HIGH_SPEED_EN (Bit 2)                      */
#define SDMMC_HOST_CTRL_HIGH_SPEED_EN_Msk     (0x4UL)                   /*!< SDMMC HOST_CTRL: HIGH_SPEED_EN (Bitfield-Mask: 0x01)        */
#define SDMMC_HOST_CTRL_SD_8BIT_MODE_Pos      (5UL)                     /*!< SDMMC HOST_CTRL: SD_8BIT_MODE (Bit 5)                       */
#define SDMMC_HOST_CTRL_SD_8BIT_MODE_Msk      (0x20UL)                  /*!< SDMMC HOST_CTRL: SD_8BIT_MODE (Bitfield-Mask: 0x01)         */
#define SDMMC_HOST_CTRL_CARD_DETECT_TEST_LEVEL_Pos (6UL)                /*!< SDMMC HOST_CTRL: CARD_DETECT_TEST_LEVEL (Bit 6)             */
#define SDMMC_HOST_CTRL_CARD_DETECT_TEST_LEVEL_Msk (0x40UL)             /*!< SDMMC HOST_CTRL: CARD_DETECT_TEST_LEVEL (Bitfield-Mask: 0x01) */
#define SDMMC_HOST_CTRL_CARD_DET_SIGNAL_DETECT_Pos (7UL)                /*!< SDMMC HOST_CTRL: CARD_DET_SIGNAL_DETECT (Bit 7)             */
#define SDMMC_HOST_CTRL_CARD_DET_SIGNAL_DETECT_Msk (0x80UL)             /*!< SDMMC HOST_CTRL: CARD_DET_SIGNAL_DETECT (Bitfield-Mask: 0x01) */

/* ------------------------------  SDMMC_POWER_CTRL  ------------------------------ */
#define SDMMC_POWER_CTRL_SD_BUS_POWER_Pos     (0UL)                     /*!< SDMMC POWER_CTRL: SD_BUS_POWER (Bit 0)                      */
#define SDMMC_POWER_CTRL_SD_BUS_POWER_Msk     (0x1UL)                   /*!< SDMMC POWER_CTRL: SD_BUS_POWER (Bitfield-Mask: 0x01)        */
#define SDMMC_POWER_CTRL_SD_BUS_VOLTAGE_SEL_Pos (1UL)                   /*!< SDMMC POWER_CTRL: SD_BUS_VOLTAGE_SEL (Bit 1)                */
#define SDMMC_POWER_CTRL_SD_BUS_VOLTAGE_SEL_Msk (0xeUL)                 /*!< SDMMC POWER_CTRL: SD_BUS_VOLTAGE_SEL (Bitfield-Mask: 0x07)  */
#define SDMMC_POWER_CTRL_HARDWARE_RESET_Pos   (4UL)                     /*!< SDMMC POWER_CTRL: HARDWARE_RESET (Bit 4)                    */
#define SDMMC_POWER_CTRL_HARDWARE_RESET_Msk   (0x10UL)                  /*!< SDMMC POWER_CTRL: HARDWARE_RESET (Bitfield-Mask: 0x01)      */

/* ----------------------------  SDMMC_BLOCK_GAP_CTRL  ---------------------------- */
#define SDMMC_BLOCK_GAP_CTRL_STOP_AT_BLOCK_GAP_Pos (0UL)                /*!< SDMMC BLOCK_GAP_CTRL: STOP_AT_BLOCK_GAP (Bit 0)             */
#define SDMMC_BLOCK_GAP_CTRL_STOP_AT_BLOCK_GAP_Msk (0x1UL)              /*!< SDMMC BLOCK_GAP_CTRL: STOP_AT_BLOCK_GAP (Bitfield-Mask: 0x01) */
#define SDMMC_BLOCK_GAP_CTRL_CONTINUE_REQ_Pos (1UL)                     /*!< SDMMC BLOCK_GAP_CTRL: CONTINUE_REQ (Bit 1)                  */
#define SDMMC_BLOCK_GAP_CTRL_CONTINUE_REQ_Msk (0x2UL)                   /*!< SDMMC BLOCK_GAP_CTRL: CONTINUE_REQ (Bitfield-Mask: 0x01)    */
#define SDMMC_BLOCK_GAP_CTRL_READ_WAIT_CTRL_Pos (2UL)                   /*!< SDMMC BLOCK_GAP_CTRL: READ_WAIT_CTRL (Bit 2)                */
#define SDMMC_BLOCK_GAP_CTRL_READ_WAIT_CTRL_Msk (0x4UL)                 /*!< SDMMC BLOCK_GAP_CTRL: READ_WAIT_CTRL (Bitfield-Mask: 0x01)  */
#define SDMMC_BLOCK_GAP_CTRL_INT_AT_BLOCK_GAP_Pos (3UL)                 /*!< SDMMC BLOCK_GAP_CTRL: INT_AT_BLOCK_GAP (Bit 3)              */
#define SDMMC_BLOCK_GAP_CTRL_INT_AT_BLOCK_GAP_Msk (0x8UL)               /*!< SDMMC BLOCK_GAP_CTRL: INT_AT_BLOCK_GAP (Bitfield-Mask: 0x01) */
#define SDMMC_BLOCK_GAP_CTRL_SPI_MODE_Pos     (4UL)                     /*!< SDMMC BLOCK_GAP_CTRL: SPI_MODE (Bit 4)                      */
#define SDMMC_BLOCK_GAP_CTRL_SPI_MODE_Msk     (0x10UL)                  /*!< SDMMC BLOCK_GAP_CTRL: SPI_MODE (Bitfield-Mask: 0x01)        */

