Infineon/mtb-xmclib-cat3/CMSIS/Infineon/COMPONENT_XMC4502/Include/XMC4502.h
/* ----------------------------------  PORT3_OMR  --------------------------------- */
#define PORT3_OMR_PS0_Pos                     (0UL)                     /*!< PORT3 OMR: PS0 (Bit 0)                                      */
#define PORT3_OMR_PS0_Msk                     (0x1UL)                   /*!< PORT3 OMR: PS0 (Bitfield-Mask: 0x01)                        */
#define PORT3_OMR_PS1_Pos                     (1UL)                     /*!< PORT3 OMR: PS1 (Bit 1)                                      */
#define PORT3_OMR_PS1_Msk                     (0x2UL)                   /*!< PORT3 OMR: PS1 (Bitfield-Mask: 0x01)                        */
#define PORT3_OMR_PS2_Pos                     (2UL)                     /*!< PORT3 OMR: PS2 (Bit 2)                                      */
#define PORT3_OMR_PS2_Msk                     (0x4UL)                   /*!< PORT3 OMR: PS2 (Bitfield-Mask: 0x01)                        */
#define PORT3_OMR_PS3_Pos                     (3UL)                     /*!< PORT3 OMR: PS3 (Bit 3)                                      */
#define PORT3_OMR_PS3_Msk                     (0x8UL)                   /*!< PORT3 OMR: PS3 (Bitfield-Mask: 0x01)                        */
#define PORT3_OMR_PS4_Pos                     (4UL)                     /*!< PORT3 OMR: PS4 (Bit 4)                                      */
#define PORT3_OMR_PS4_Msk                     (0x10UL)                  /*!< PORT3 OMR: PS4 (Bitfield-Mask: 0x01)                        */
#define PORT3_OMR_PS5_Pos                     (5UL)                     /*!< PORT3 OMR: PS5 (Bit 5)                                      */
#define PORT3_OMR_PS5_Msk                     (0x20UL)                  /*!< PORT3 OMR: PS5 (Bitfield-Mask: 0x01)                        */
#define PORT3_OMR_PS6_Pos                     (6UL)                     /*!< PORT3 OMR: PS6 (Bit 6)                                      */
#define PORT3_OMR_PS6_Msk                     (0x40UL)                  /*!< PORT3 OMR: PS6 (Bitfield-Mask: 0x01)                        */
#define PORT3_OMR_PS7_Pos                     (7UL)                     /*!< PORT3 OMR: PS7 (Bit 7)                                      */
#define PORT3_OMR_PS7_Msk                     (0x80UL)                  /*!< PORT3 OMR: PS7 (Bitfield-Mask: 0x01)                        */
#define PORT3_OMR_PS8_Pos                     (8UL)                     /*!< PORT3 OMR: PS8 (Bit 8)                                      */
#define PORT3_OMR_PS8_Msk                     (0x100UL)                 /*!< PORT3 OMR: PS8 (Bitfield-Mask: 0x01)                        */
#define PORT3_OMR_PS9_Pos                     (9UL)                     /*!< PORT3 OMR: PS9 (Bit 9)                                      */
#define PORT3_OMR_PS9_Msk                     (0x200UL)                 /*!< PORT3 OMR: PS9 (Bitfield-Mask: 0x01)                        */
#define PORT3_OMR_PS10_Pos                    (10UL)                    /*!< PORT3 OMR: PS10 (Bit 10)                                    */
#define PORT3_OMR_PS10_Msk                    (0x400UL)                 /*!< PORT3 OMR: PS10 (Bitfield-Mask: 0x01)                       */
#define PORT3_OMR_PS11_Pos                    (11UL)                    /*!< PORT3 OMR: PS11 (Bit 11)                                    */
#define PORT3_OMR_PS11_Msk                    (0x800UL)                 /*!< PORT3 OMR: PS11 (Bitfield-Mask: 0x01)                       */
#define PORT3_OMR_PS12_Pos                    (12UL)                    /*!< PORT3 OMR: PS12 (Bit 12)                                    */
#define PORT3_OMR_PS12_Msk                    (0x1000UL)                /*!< PORT3 OMR: PS12 (Bitfield-Mask: 0x01)                       */
#define PORT3_OMR_PS13_Pos                    (13UL)                    /*!< PORT3 OMR: PS13 (Bit 13)                                    */
#define PORT3_OMR_PS13_Msk                    (0x2000UL)                /*!< PORT3 OMR: PS13 (Bitfield-Mask: 0x01)                       */
#define PORT3_OMR_PS14_Pos                    (14UL)                    /*!< PORT3 OMR: PS14 (Bit 14)                                    */
#define PORT3_OMR_PS14_Msk                    (0x4000UL)                /*!< PORT3 OMR: PS14 (Bitfield-Mask: 0x01)                       */
#define PORT3_OMR_PS15_Pos                    (15UL)                    /*!< PORT3 OMR: PS15 (Bit 15)                                    */
#define PORT3_OMR_PS15_Msk                    (0x8000UL)                /*!< PORT3 OMR: PS15 (Bitfield-Mask: 0x01)                       */
#define PORT3_OMR_PR0_Pos                     (16UL)                    /*!< PORT3 OMR: PR0 (Bit 16)                                     */
#define PORT3_OMR_PR0_Msk                     (0x10000UL)               /*!< PORT3 OMR: PR0 (Bitfield-Mask: 0x01)                        */
#define PORT3_OMR_PR1_Pos                     (17UL)                    /*!< PORT3 OMR: PR1 (Bit 17)                                     */
#define PORT3_OMR_PR1_Msk                     (0x20000UL)               /*!< PORT3 OMR: PR1 (Bitfield-Mask: 0x01)                        */
#define PORT3_OMR_PR2_Pos                     (18UL)                    /*!< PORT3 OMR: PR2 (Bit 18)                                     */
#define PORT3_OMR_PR2_Msk                     (0x40000UL)               /*!< PORT3 OMR: PR2 (Bitfield-Mask: 0x01)                        */
#define PORT3_OMR_PR3_Pos                     (19UL)                    /*!< PORT3 OMR: PR3 (Bit 19)                                     */
#define PORT3_OMR_PR3_Msk                     (0x80000UL)               /*!< PORT3 OMR: PR3 (Bitfield-Mask: 0x01)                        */
#define PORT3_OMR_PR4_Pos                     (20UL)                    /*!< PORT3 OMR: PR4 (Bit 20)                                     */
#define PORT3_OMR_PR4_Msk                     (0x100000UL)              /*!< PORT3 OMR: PR4 (Bitfield-Mask: 0x01)                        */
#define PORT3_OMR_PR5_Pos                     (21UL)                    /*!< PORT3 OMR: PR5 (Bit 21)                                     */
#define PORT3_OMR_PR5_Msk                     (0x200000UL)              /*!< PORT3 OMR: PR5 (Bitfield-Mask: 0x01)                        */
#define PORT3_OMR_PR6_Pos                     (22UL)                    /*!< PORT3 OMR: PR6 (Bit 22)                                     */
#define PORT3_OMR_PR6_Msk                     (0x400000UL)              /*!< PORT3 OMR: PR6 (Bitfield-Mask: 0x01)                        */
#define PORT3_OMR_PR7_Pos                     (23UL)                    /*!< PORT3 OMR: PR7 (Bit 23)                                     */
#define PORT3_OMR_PR7_Msk                     (0x800000UL)              /*!< PORT3 OMR: PR7 (Bitfield-Mask: 0x01)                        */
#define PORT3_OMR_PR8_Pos                     (24UL)                    /*!< PORT3 OMR: PR8 (Bit 24)                                     */
#define PORT3_OMR_PR8_Msk                     (0x1000000UL)             /*!< PORT3 OMR: PR8 (Bitfield-Mask: 0x01)                        */
#define PORT3_OMR_PR9_Pos                     (25UL)                    /*!< PORT3 OMR: PR9 (Bit 25)                                     */
#define PORT3_OMR_PR9_Msk                     (0x2000000UL)             /*!< PORT3 OMR: PR9 (Bitfield-Mask: 0x01)                        */
#define PORT3_OMR_PR10_Pos                    (26UL)                    /*!< PORT3 OMR: PR10 (Bit 26)                                    */
#define PORT3_OMR_PR10_Msk                    (0x4000000UL)             /*!< PORT3 OMR: PR10 (Bitfield-Mask: 0x01)                       */
#define PORT3_OMR_PR11_Pos                    (27UL)                    /*!< PORT3 OMR: PR11 (Bit 27)                                    */
#define PORT3_OMR_PR11_Msk                    (0x8000000UL)             /*!< PORT3 OMR: PR11 (Bitfield-Mask: 0x01)                       */
#define PORT3_OMR_PR12_Pos                    (28UL)                    /*!< PORT3 OMR: PR12 (Bit 28)                                    */
#define PORT3_OMR_PR12_Msk                    (0x10000000UL)            /*!< PORT3 OMR: PR12 (Bitfield-Mask: 0x01)                       */
#define PORT3_OMR_PR13_Pos                    (29UL)                    /*!< PORT3 OMR: PR13 (Bit 29)                                    */
#define PORT3_OMR_PR13_Msk                    (0x20000000UL)            /*!< PORT3 OMR: PR13 (Bitfield-Mask: 0x01)                       */
#define PORT3_OMR_PR14_Pos                    (30UL)                    /*!< PORT3 OMR: PR14 (Bit 30)                                    */
#define PORT3_OMR_PR14_Msk                    (0x40000000UL)            /*!< PORT3 OMR: PR14 (Bitfield-Mask: 0x01)                       */
#define PORT3_OMR_PR15_Pos                    (31UL)                    /*!< PORT3 OMR: PR15 (Bit 31)                                    */
#define PORT3_OMR_PR15_Msk                    (0x80000000UL)            /*!< PORT3 OMR: PR15 (Bitfield-Mask: 0x01)                       */

/* ---------------------------------  PORT3_IOCR0  -------------------------------- */
#define PORT3_IOCR0_PC0_Pos                   (3UL)                     /*!< PORT3 IOCR0: PC0 (Bit 3)                                    */
#define PORT3_IOCR0_PC0_Msk                   (0xf8UL)                  /*!< PORT3 IOCR0: PC0 (Bitfield-Mask: 0x1f)                      */
#define PORT3_IOCR0_PC1_Pos                   (11UL)                    /*!< PORT3 IOCR0: PC1 (Bit 11)                                   */
#define PORT3_IOCR0_PC1_Msk                   (0xf800UL)                /*!< PORT3 IOCR0: PC1 (Bitfield-Mask: 0x1f)                      */
#define PORT3_IOCR0_PC2_Pos                   (19UL)                    /*!< PORT3 IOCR0: PC2 (Bit 19)                                   */
#define PORT3_IOCR0_PC2_Msk                   (0xf80000UL)              /*!< PORT3 IOCR0: PC2 (Bitfield-Mask: 0x1f)                      */
#define PORT3_IOCR0_PC3_Pos                   (27UL)                    /*!< PORT3 IOCR0: PC3 (Bit 27)                                   */
#define PORT3_IOCR0_PC3_Msk                   (0xf8000000UL)            /*!< PORT3 IOCR0: PC3 (Bitfield-Mask: 0x1f)                      */

/* ---------------------------------  PORT3_IOCR4  -------------------------------- */
#define PORT3_IOCR4_PC4_Pos                   (3UL)                     /*!< PORT3 IOCR4: PC4 (Bit 3)                                    */
#define PORT3_IOCR4_PC4_Msk                   (0xf8UL)                  /*!< PORT3 IOCR4: PC4 (Bitfield-Mask: 0x1f)                      */
#define PORT3_IOCR4_PC5_Pos                   (11UL)                    /*!< PORT3 IOCR4: PC5 (Bit 11)                                   */
#define PORT3_IOCR4_PC5_Msk                   (0xf800UL)                /*!< PORT3 IOCR4: PC5 (Bitfield-Mask: 0x1f)                      */
#define PORT3_IOCR4_PC6_Pos                   (19UL)                    /*!< PORT3 IOCR4: PC6 (Bit 19)                                   */
#define PORT3_IOCR4_PC6_Msk                   (0xf80000UL)              /*!< PORT3 IOCR4: PC6 (Bitfield-Mask: 0x1f)                      */
#define PORT3_IOCR4_PC7_Pos                   (27UL)                    /*!< PORT3 IOCR4: PC7 (Bit 27)                                   */
#define PORT3_IOCR4_PC7_Msk                   (0xf8000000UL)            /*!< PORT3 IOCR4: PC7 (Bitfield-Mask: 0x1f)                      */

/* ---------------------------------  PORT3_IOCR8  -------------------------------- */
#define PORT3_IOCR8_PC8_Pos                   (3UL)                     /*!< PORT3 IOCR8: PC8 (Bit 3)                                    */
#define PORT3_IOCR8_PC8_Msk                   (0xf8UL)                  /*!< PORT3 IOCR8: PC8 (Bitfield-Mask: 0x1f)                      */
#define PORT3_IOCR8_PC9_Pos                   (11UL)                    /*!< PORT3 IOCR8: PC9 (Bit 11)                                   */
#define PORT3_IOCR8_PC9_Msk                   (0xf800UL)                /*!< PORT3 IOCR8: PC9 (Bitfield-Mask: 0x1f)                      */
#define PORT3_IOCR8_PC10_Pos                  (19UL)                    /*!< PORT3 IOCR8: PC10 (Bit 19)                                  */
#define PORT3_IOCR8_PC10_Msk                  (0xf80000UL)              /*!< PORT3 IOCR8: PC10 (Bitfield-Mask: 0x1f)                     */
#define PORT3_IOCR8_PC11_Pos                  (27UL)                    /*!< PORT3 IOCR8: PC11 (Bit 27)                                  */
#define PORT3_IOCR8_PC11_Msk                  (0xf8000000UL)            /*!< PORT3 IOCR8: PC11 (Bitfield-Mask: 0x1f)                     */

/* --------------------------------  PORT3_IOCR12  -------------------------------- */
#define PORT3_IOCR12_PC12_Pos                 (3UL)                     /*!< PORT3 IOCR12: PC12 (Bit 3)                                  */
#define PORT3_IOCR12_PC12_Msk                 (0xf8UL)                  /*!< PORT3 IOCR12: PC12 (Bitfield-Mask: 0x1f)                    */
#define PORT3_IOCR12_PC13_Pos                 (11UL)                    /*!< PORT3 IOCR12: PC13 (Bit 11)                                 */
#define PORT3_IOCR12_PC13_Msk                 (0xf800UL)                /*!< PORT3 IOCR12: PC13 (Bitfield-Mask: 0x1f)                    */
#define PORT3_IOCR12_PC14_Pos                 (19UL)                    /*!< PORT3 IOCR12: PC14 (Bit 19)                                 */
#define PORT3_IOCR12_PC14_Msk                 (0xf80000UL)              /*!< PORT3 IOCR12: PC14 (Bitfield-Mask: 0x1f)                    */
#define PORT3_IOCR12_PC15_Pos                 (27UL)                    /*!< PORT3 IOCR12: PC15 (Bit 27)                                 */
#define PORT3_IOCR12_PC15_Msk                 (0xf8000000UL)            /*!< PORT3 IOCR12: PC15 (Bitfield-Mask: 0x1f)                    */

/* ----------------------------------  PORT3_IN  ---------------------------------- */
#define PORT3_IN_P0_Pos                       (0UL)                     /*!< PORT3 IN: P0 (Bit 0)                                        */
#define PORT3_IN_P0_Msk                       (0x1UL)                   /*!< PORT3 IN: P0 (Bitfield-Mask: 0x01)                          */
#define PORT3_IN_P1_Pos                       (1UL)                     /*!< PORT3 IN: P1 (Bit 1)                                        */
#define PORT3_IN_P1_Msk                       (0x2UL)                   /*!< PORT3 IN: P1 (Bitfield-Mask: 0x01)                          */
#define PORT3_IN_P2_Pos                       (2UL)                     /*!< PORT3 IN: P2 (Bit 2)                                        */
#define PORT3_IN_P2_Msk                       (0x4UL)                   /*!< PORT3 IN: P2 (Bitfield-Mask: 0x01)                          */
#define PORT3_IN_P3_Pos                       (3UL)                     /*!< PORT3 IN: P3 (Bit 3)                                        */
#define PORT3_IN_P3_Msk                       (0x8UL)                   /*!< PORT3 IN: P3 (Bitfield-Mask: 0x01)                          */
#define PORT3_IN_P4_Pos                       (4UL)                     /*!< PORT3 IN: P4 (Bit 4)                                        */
#define PORT3_IN_P4_Msk                       (0x10UL)                  /*!< PORT3 IN: P4 (Bitfield-Mask: 0x01)                          */
#define PORT3_IN_P5_Pos                       (5UL)                     /*!< PORT3 IN: P5 (Bit 5)                                        */
#define PORT3_IN_P5_Msk                       (0x20UL)                  /*!< PORT3 IN: P5 (Bitfield-Mask: 0x01)                          */
#define PORT3_IN_P6_Pos                       (6UL)                     /*!< PORT3 IN: P6 (Bit 6)                                        */
#define PORT3_IN_P6_Msk                       (0x40UL)                  /*!< PORT3 IN: P6 (Bitfield-Mask: 0x01)                          */
#define PORT3_IN_P7_Pos                       (7UL)                     /*!< PORT3 IN: P7 (Bit 7)                                        */
#define PORT3_IN_P7_Msk                       (0x80UL)                  /*!< PORT3 IN: P7 (Bitfield-Mask: 0x01)                          */
#define PORT3_IN_P8_Pos                       (8UL)                     /*!< PORT3 IN: P8 (Bit 8)                                        */
#define PORT3_IN_P8_Msk                       (0x100UL)                 /*!< PORT3 IN: P8 (Bitfield-Mask: 0x01)                          */
#define PORT3_IN_P9_Pos                       (9UL)                     /*!< PORT3 IN: P9 (Bit 9)                                        */
#define PORT3_IN_P9_Msk                       (0x200UL)                 /*!< PORT3 IN: P9 (Bitfield-Mask: 0x01)                          */
#define PORT3_IN_P10_Pos                      (10UL)                    /*!< PORT3 IN: P10 (Bit 10)                                      */
#define PORT3_IN_P10_Msk                      (0x400UL)                 /*!< PORT3 IN: P10 (Bitfield-Mask: 0x01)                         */
#define PORT3_IN_P11_Pos                      (11UL)                    /*!< PORT3 IN: P11 (Bit 11)                                      */
#define PORT3_IN_P11_Msk                      (0x800UL)                 /*!< PORT3 IN: P11 (Bitfield-Mask: 0x01)                         */
#define PORT3_IN_P12_Pos                      (12UL)                    /*!< PORT3 IN: P12 (Bit 12)                                      */
#define PORT3_IN_P12_Msk                      (0x1000UL)                /*!< PORT3 IN: P12 (Bitfield-Mask: 0x01)                         */
#define PORT3_IN_P13_Pos                      (13UL)                    /*!< PORT3 IN: P13 (Bit 13)                                      */
#define PORT3_IN_P13_Msk                      (0x2000UL)                /*!< PORT3 IN: P13 (Bitfield-Mask: 0x01)                         */
#define PORT3_IN_P14_Pos                      (14UL)                    /*!< PORT3 IN: P14 (Bit 14)                                      */
#define PORT3_IN_P14_Msk                      (0x4000UL)                /*!< PORT3 IN: P14 (Bitfield-Mask: 0x01)                         */
#define PORT3_IN_P15_Pos                      (15UL)                    /*!< PORT3 IN: P15 (Bit 15)                                      */
#define PORT3_IN_P15_Msk                      (0x8000UL)                /*!< PORT3 IN: P15 (Bitfield-Mask: 0x01)                         */

/* ---------------------------------  PORT3_PDR0  --------------------------------- */
#define PORT3_PDR0_PD0_Pos                    (0UL)                     /*!< PORT3 PDR0: PD0 (Bit 0)                                     */
#define PORT3_PDR0_PD0_Msk                    (0x7UL)                   /*!< PORT3 PDR0: PD0 (Bitfield-Mask: 0x07)                       */
#define PORT3_PDR0_PD1_Pos                    (4UL)                     /*!< PORT3 PDR0: PD1 (Bit 4)                                     */
#define PORT3_PDR0_PD1_Msk                    (0x70UL)                  /*!< PORT3 PDR0: PD1 (Bitfield-Mask: 0x07)                       */
#define PORT3_PDR0_PD2_Pos                    (8UL)                     /*!< PORT3 PDR0: PD2 (Bit 8)                                     */
#define PORT3_PDR0_PD2_Msk                    (0x700UL)                 /*!< PORT3 PDR0: PD2 (Bitfield-Mask: 0x07)                       */
#define PORT3_PDR0_PD3_Pos                    (12UL)                    /*!< PORT3 PDR0: PD3 (Bit 12)                                    */
#define PORT3_PDR0_PD3_Msk                    (0x7000UL)                /*!< PORT3 PDR0: PD3 (Bitfield-Mask: 0x07)                       */
#define PORT3_PDR0_PD4_Pos                    (16UL)                    /*!< PORT3 PDR0: PD4 (Bit 16)                                    */
#define PORT3_PDR0_PD4_Msk                    (0x70000UL)               /*!< PORT3 PDR0: PD4 (Bitfield-Mask: 0x07)                       */
#define PORT3_PDR0_PD5_Pos                    (20UL)                    /*!< PORT3 PDR0: PD5 (Bit 20)                                    */
#define PORT3_PDR0_PD5_Msk                    (0x700000UL)              /*!< PORT3 PDR0: PD5 (Bitfield-Mask: 0x07)                       */
#define PORT3_PDR0_PD6_Pos                    (24UL)                    /*!< PORT3 PDR0: PD6 (Bit 24)                                    */
#define PORT3_PDR0_PD6_Msk                    (0x7000000UL)             /*!< PORT3 PDR0: PD6 (Bitfield-Mask: 0x07)                       */
#define PORT3_PDR0_PD7_Pos                    (28UL)                    /*!< PORT3 PDR0: PD7 (Bit 28)                                    */
#define PORT3_PDR0_PD7_Msk                    (0x70000000UL)            /*!< PORT3 PDR0: PD7 (Bitfield-Mask: 0x07)                       */

/* ---------------------------------  PORT3_PDR1  --------------------------------- */
#define PORT3_PDR1_PD8_Pos                    (0UL)                     /*!< PORT3 PDR1: PD8 (Bit 0)                                     */
#define PORT3_PDR1_PD8_Msk                    (0x7UL)                   /*!< PORT3 PDR1: PD8 (Bitfield-Mask: 0x07)                       */
#define PORT3_PDR1_PD9_Pos                    (4UL)                     /*!< PORT3 PDR1: PD9 (Bit 4)                                     */
#define PORT3_PDR1_PD9_Msk                    (0x70UL)                  /*!< PORT3 PDR1: PD9 (Bitfield-Mask: 0x07)                       */
#define PORT3_PDR1_PD10_Pos                   (8UL)                     /*!< PORT3 PDR1: PD10 (Bit 8)                                    */
#define PORT3_PDR1_PD10_Msk                   (0x700UL)                 /*!< PORT3 PDR1: PD10 (Bitfield-Mask: 0x07)                      */
#define PORT3_PDR1_PD11_Pos                   (12UL)                    /*!< PORT3 PDR1: PD11 (Bit 12)                                   */
#define PORT3_PDR1_PD11_Msk                   (0x7000UL)                /*!< PORT3 PDR1: PD11 (Bitfield-Mask: 0x07)                      */
#define PORT3_PDR1_PD12_Pos                   (16UL)                    /*!< PORT3 PDR1: PD12 (Bit 16)                                   */
#define PORT3_PDR1_PD12_Msk                   (0x70000UL)               /*!< PORT3 PDR1: PD12 (Bitfield-Mask: 0x07)                      */
#define PORT3_PDR1_PD13_Pos                   (20UL)                    /*!< PORT3 PDR1: PD13 (Bit 20)                                   */
#define PORT3_PDR1_PD13_Msk                   (0x700000UL)              /*!< PORT3 PDR1: PD13 (Bitfield-Mask: 0x07)                      */
#define PORT3_PDR1_PD14_Pos                   (24UL)                    /*!< PORT3 PDR1: PD14 (Bit 24)                                   */
#define PORT3_PDR1_PD14_Msk                   (0x7000000UL)             /*!< PORT3 PDR1: PD14 (Bitfield-Mask: 0x07)                      */
#define PORT3_PDR1_PD15_Pos                   (28UL)                    /*!< PORT3 PDR1: PD15 (Bit 28)                                   */
#define PORT3_PDR1_PD15_Msk                   (0x70000000UL)            /*!< PORT3 PDR1: PD15 (Bitfield-Mask: 0x07)                      */

